[
  {
    "id": "peopletracker",
    "title": "People Tracker with Identification",
    "description": "A real-time people tracking system using face recognition powered by InsightFace and DeepFace.<br/><br/>    The system captures video from a webcam, detects faces, extracts facial features, and matches them against a database of known individuals using FAISS for fast similarity search.<br/><br/>    Includes a Streamlit-based interface for managing the database of known faces, with features to view, add, remove, and merge duplicate identities. The system also provides emotion analysis and face smoothing for enhanced insights.",
    "technologies": ["Python", "OpenCV", "Streamlit", "FAISS", "InsightFace", "DeepFace"],
    "tools": ["Computer Vision", "Face Recognition", "Real-time Processing"],
    "category": "MLCV",
    "github": "https://github.com/MikeCheek/people-tracking"
  },
  {
    "id": "plantguardian",
    "title": "Plant Guardian (in progress)",
    "description": "A mobile application for monitoring and taking care of indoor plants.<br/><br/>    The application combines the use of Computer Vision techniques to identify plant species and an AI Agent with LLM model to provide personalized care advice based on user input and environmental data.",
    "technologies": ["Flutter", "Dart", "Python", "OpenCV"],
    "tools": ["Computer Vision", "AI Agents", "Large Language Models"],
    "category": ["MLCV", "LLM"],
    "github": "https://github.com/MikeCheek/plant_guardian"
  },
  {
    "id": "termuxcmdhub",
    "title": "Termux Command Hub",
    "description": "A fullstack web application designed to manage better Termux active processes and commands.<br/><br/>    Termux is a terminal emulator for Android that allows users to run a Linux environment on their mobile devices. This makes possibleto make an old smartphone a home server but managing processes remotely can be challenging.<br/><br/>    The application allows users to start, stop, and monitor termux commands remotely through a user-friendly web interface.<br/><br/>    Since Docker is not natively supported on Android, PM2 is used as a process manager to keep commands running in the background and restart them if they crash.",
    "technologies": ["Nest JS", "Vite JS", "PM2", "TypeScript", "TailwindCSS"],
    "tools": ["Termux", "Fullstack Development", "Process Management", "WebSockets"],
    "category": "WEB",
    "github": "https://github.com/MikeCheek/termux-process-manager"
  },
  {
    "id": "gpt2fromscratch",
    "title": "GPT-2 from Scratch",
    "description": "Implementation of the GPT-2 architecture from scratch using PyTorch.<br/><br/>   The model architecture is implemented in PyTorch, including components such as multi-head self-attention, feed-forward neural network, and layer normalization.<br/><br/>   The official model's weights published by OpenAI are used to initialize the model.",
    "github": "https://github.com/MikeCheek/gpt-2-from-scratch",
    "technologies": ["Python", "PyTorch"],
    "tools": ["Natural Language Processing", "Large Language Models"],
    "category": "LLM"
  },
  {
    "id": "segmentationpointcloud",
    "title": "Segmentation of Heritage Building Point Clouds",
    "description": "Development of a computer program for segmenting point clouds of old monuments.<br/><br/>    The final program implements 2 segmentation approaches:    <ul>    <li>A segmentation completer where a Machine Learning classifier is trained on a partially segmented part of a point cloud and used to propagate the segmentation</li>    <li>A neural network model that was trained on a dataset is used to segment unlabelled point clouds</li>    </ul>    This project was developed during my internship at A-BIME in Paris and served as the core subject of my Master's thesis.",
    "technologies": ["Python", "PyTorch", "scikit-learn", "PyQt6"],
    "tools": ["Computer Vision", "Point Cloud Segmentation", "PointNet++", "DGCNN"],
    "category": "MLCV",
    "href": "https://webthesis.biblio.polito.it/37726/",
    "hrefText": "Thesis Document"
  },
  {
    "id": "psicologialetizia",
    "title": "Psychology Website",
    "description": "Website created for Dr. Letizia Puglisi, a licensed psychologist.<br/><br/>    The website provides information about her professional services, areas of expertise, and contact details for potential clients.<br/><br/>    Built with GatsbyJS and Typescript, the site features a clean and user-friendly design to ensure easy navigation and accessibility for visitors.",
    "href": "https://www.psicologialetizia.it",
    "category": "WEB",
    "technologies": ["GatsbyJs", "Typescript", "TailwindCSS"],
    "tools": ["SEO Optimization", "Responsive Design"]
  },
  {
    "id": "segmentationunderwater",
    "title": "Semantic Segmentation of Underwater Imagery",
    "description": "This project focuses on developing a multi-class segmentation algorithm for underwater images.<br/><br/>    The U-Net model was used and enhanced by incorporating a dropout mechanism to mitigate overfitting.<br/>    Various images manipulation techniques were applied to calculate database statistics and to improve the data through preprocessing and augmentation.<br/><br/>    Project developed for Machine Learning for CV course at ESILV.",
    "github": "https://github.com/MikeCheek/Semantic-Segmentation-of-Underwater-Imagery",
    "technologies": ["Python", "OpenCV", "PyTorch", "MatplotLib", "NumPy"],
    "tools": ["Computer Vision", "Segmentation models"],
    "category": "MLCV"
  },
  {
    "id": "nlprecommendation",
    "title": "TripAdvisor Recommendation Challenge",
    "description": "A machine learning project focused on building a recommendation system for TripAdvisor reviews.     Starting with a BM25 baseline, advanced NLP models like BERT and Sentence Transformers were tested, with Roberta achieving the best results.<br/><br/>      Preprocessing included language filtering, tokenization, and lemmatization to enhance data quality. An ensemble learning approach combined model outputs to improve recommendation accuracy.<br/><br/>      Project developed for Machine Learning for NLP course at ESILV.",
    "github": "https://github.com/MikeCheek/Project1-MachineLearningForNLP",
    "technologies": ["Python", "NumPy", "Pandas", "nltk", "PyTorch"],
    "tools": ["Natural Language Processing", "Ensemble Learning"],
    "category": "MLNLP"
  },
  {
    "id": "minerecognition",
    "title": "Mine Recognition",
    "description": "Training of a YOLO-based model designed to recognize a custom mine (PFM-1).<br/><br/>    We created a dedicated photo dataset by 3D printing the PFM-1 mine and capturing images to feed the YOLO model.<br/><br/>    The project involved dataset creation, annotation, model training, and evaluation for robust object detection.",
    "github": "https://github.com/MikeCheek/mine-recognition",
    "technologies": ["Python", "YOLO"],
    "tools": ["Computer Vision", "Object Detection"],
    "category": "MLCV"
  },
  {
    "id": "mlbusinessassistant",
    "title": "ML-powered Business Assistant Chatbot",
    "description": "ML-powered business assistant implemented as a chatbot in a Streamlit app.<br/><br/>    At its core, the system uses NLP techniques with a fine-tuned DistilBERT classifier trained on a custom dataset to recognize six business-related intents, such as generating LinkedIn notes, researching B2B accounts, and extracting company value propositions.<br/><br/>    spaCy was integrated for preprocessing and keyword extraction, while pre-trained transformer models were used for sentiment analysis and question answering.<br/>    A T5-small model was fine-tuned to generate personalized LinkedIn connection notes. Real-time company research was enabled via APIs and web scraping (LinkedIn, News APIs, Google Search, BeautifulSoup, Selenium).<br/><br/>    For a deeper explanation, see <a href='https://github.com/MikeCheek/ML-Tool-for-business/blob/main/ML_Tool_Explanation.pdf' class='link' target='_blank' rel='noopener noreferrer'>the project documentation</a>.",
    "github": "https://github.com/MikeCheek/ML-Tool-for-business",
    "technologies": ["Python", "Streamlit", "spaCy", "Transformers", "BeautifulSoup", "Selenium"],
    "tools": ["Natural Language Processing", "Web Scraping", "API Integration"],
    "category": "MLNLP"
  },
  {
    "id": "naturalmentetecnologici",
    "title": "Naturalmente Tecnologici",
    "description": "Website created on the occasion of the Naturalmente Tecnologici event organized by the Syskrack association in Grassano (Matera)<br/><br/>      During the event there were conferences and workshops on the theme of ethical and sustainable technological development in social and environmental terms.<br/><br/>      In the background is implemented a working <a href='https://en.wikipedia.org/wiki/Flocking' class='link' rel='noopener noreferrer' alt='Flocking simulation'>Flocking simulation</a> (to be activated by clicking on 'Animate Background')",
    "href": "https://nt.syskrack.org",
    "github": "https://github.com/MikeCheek/naturalmente-tecnologici",
    "technologies": ["GatsbyJs", "Typescript", "Sass"],
    "tools": ["FTP Deploy Action"],
    "category": "WEB"
  },
  {
    "id": "quoridorlandtiger",
    "title": "Quoridor - LandTiger",
    "description": "Project developed for the extrapoint of \"Architetture dei sistemi di elaborazione\" course at Politecnico di Torino 2023/2024.<br/><br/>The aim of the project was to acquire full confidence in using the KEIL software debug environment to emulate the behaviour of the LPC1768 and the LANDTIGER board.<br/><br/>To achieve this result we were asked to develop a working reprodution of the Quoridor game.",
    "github": "https://github.com/MikeCheek/ASE-Extrapoint-1-Quoridor",
    "technologies": ["C", "ARM Assembly"],
    "tools": ["Keil"],
    "category": "LOW"
  },
  {
    "id": "popfunding",
    "title": "Pop! Funding",
    "description": "A working crowdfunding web application based on Algorand Blockchain where anyone with Algo can create a funding or donate<br/><br/>    This is the Project Work proposed by Algorand to the attendees of MasterZ 2nd Edition.<br/><br/>    Doing this Project Work we had the opportunity to test and improve our knowledge of the Algorand blockchain and to learn how to use it in the development of a crowdfunding platform.<br/><br/>    Visit the site and try to click on bubbles!",
    "href": "https://pop-funding.vercel.app",
    "github": "https://github.com/MikeCheek/pop-funding",
    "technologies": ["NextJs", "Typescript", "TailwindCSS"],
    "tools": ["ESLint", "Prettier"],
    "category": "WEB"
  },
  {
    "id": "wordgame",
    "title": "Word Game",
    "description": "WebApp developed for fun and to try something new<br/><br/>                It is a simple guess the hidden word game and you can play in english or in italian<br/><br/>                This webapp is also a PWA, so you can install it and play offline<br/><br/>                When you guess the word, you can also see its definition (only available in English).                It's a great way to play and learn at the same time!",
    "href": "https://mikecheek.github.io/wordgame",
    "github": "https://github.com/MikeCheek/wordgame",
    "technologies": ["GatsbyJs", "Typescript", "Sass"],
    "category": "WEB"
  }
]
